Tekla Open API Reference for Tekla Structures 2025
Assembly.DeleteUserDefinedCoordSys Method
 Deletes the assembly's user defined coordinate system, if it has one.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public bool DeleteUserDefinedCoordSys()
Public Function DeleteUserDefinedCoordSys As Boolean
Return Value
Type: Boolean
True on success.
Remarks
Currently only supported with rebar assemblies.
See Also
Reference
Assembly Class
Tekla.Structures.Model Namespace